chat-stress.yml
config:
  # target: "http://3.38.143.25:8000/room" middle
  target: "http://3.37.36.7:8000/"
  phases:
    - duration: 60
      arrivalRate: 50
  processor: "./util.js"
  payload:
    path: "./user_token.csv"
    fields:
      - "token"
  socketio:
    extraHeaders:
      authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJrYWthb1VzZXJJZCI6IjE5OTgzMjg3NDgiLCJuaWNrbmFtZSI6Iuu5teuPjOydtCIsImJpcnRoRGF0ZSI6IjE5OTUtMDUtMDFUMDA6MDA6MDAuMDAwWiIsImdlbmRlciI6MCwicGhvdG9VcmwiOiJodHRwczovL2sua2FrYW9jZG4ubmV0L2RuLzZmN3NKL2J0cm04MzJxN1FSL0Fac2hweGJ2NHRMUjNLNVZlOW9Mc0svaW1nXzY0MHg2NDAuanBnIiwiaWF0IjoxNjM5MDY0ODA3LCJleHAiOjE2NzA2MjI0MDd9.e10aAuw1uWnkt398mTIhKJxrCbGEzMH4df1bq1SwLNk"

scenarios:
  - name: "Connect and join Room"
    engine: socketio
    flow:
      - emit:
          channel: ""
          data: ""
        response:
          channel: "chats"
          capture:
            json: "$.recentMessage.chatName"
            as: "res"
      - log: "{{res}}"
      - get:
          url: "http://localhost:8000/chats/name/{{ res }}"
          capture:
            json: "$"
            as: "text"
      # - log: "{{text}}"