chat-stress.yml
config:
  # target: "http://3.38.143.25:8000/room" middle
  target: "http://3.37.36.7:8000/"
  phases:
    - duration: 60
      arrivalRate: 50
  processor: "./util.js"
  payload:
    path: "./user_token.csv"
    fields:
      - "token"
  socketio:
    extraHeaders:
      authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJrYWthb1VzZXJJZCI6IjE5OTI3MzkxNDUiLCJuaWNrbmFtZSI6Iu2DgOyelCIsImJpcnRoRGF0ZSI6IjE5OTItMTEtMjVUMTU6MDA6MDAuMDAwWiIsImdlbmRlciI6MCwicGhvdG9VcmwiOiJodHRwczovL2sua2FrYW9jZG4ubmV0L2RuL2JhNk9PWS9idHJrNk83WHBkTS96dTR0YWsxRjd4cGkxUjVCbjJEelkwL2ltZ182NDB4NjQwLmpwZyIsImlhdCI6MTYzOTA1OTIyOCwiZXhwIjoxNjcwNjE2ODI4fQ.UVJ__jZeZYacmBVvnxXs4y60r-vjJjqybxp24vJ0jgc"

scenarios:
  - name: "Connect and join Room"
    engine: socketio
    flow:
      - emit:
          channel: ""
          data: ""
        response:
          channel: "chats"
          capture:
            json: "$.recentMessage.chatName"
            as: "res"
      # - log: "{{res}}"
      - get:
          url: "http://localhost:8000/chats/name/{{ res }}"
          capture:
            json: "$"
            as: "text"
      # - log: "{{text}}"