socket-stress.yml
config:
  # target: "http://3.38.143.25:8000/room" middle
  target: "http://3.37.36.7:8000/room"
  phases:
    - duration: 40
      arrivalRate: 250
  processor: "./util.js"
  payload:
    path: "./user.csv"
    fields:
      - "gender"
      - "userId"
      - "nickname"

scenarios:
  - name: "Connect and join Room"
    engine: socketio
    flow:
      - emit:
          channel: "matchstart"
          data:
            userId: "{{ userId }}"
            nickname: "{{ nickname }}"
            gender: "{{ gender }}"
      - think: 100